package ui;

// ИДЕНТИФИКАТОРЫ ЭКРАНОВ И КОМАНД
public enum ScreenId {
    CLASS_SELECT, // ЭКРАН ВЫБОРА КЛАССА ДЛЯ КОЛЛЕКЦИИ
    FILL_METHOD, // ЭКРАН ВЫБОРА СПОСОБА ЗАПОЛНЕНИЯ КОЛЛЕКЦИИ
    FIELD_SELECT, // ЭКРАН ВЫБОРА ПОЛЯ ДЛЯ СОРТИРОВКИ
    SORT_TYPE, // ЭКРАН ВЫБОРА ТИПА СОРТИРОВКИ
    LIST_LENGTH, // ЭКРАН ДЛЯ УКАЗАНИЯ ДЛИНА КОЛЛЕКЦИИ
    MANUAL_INPUT, // ЭКРАН РУЧНОГО ВВОДА ПОЛЬЗОВАТЕЛЯ
    SORTED_LIST, // ЭКРАН ВЫВОДА ОТСОРТИРОВАННЫХ ДАННЫХ
    RECORD_FILE, // ЭКРАН СОХРАНЕНИЯ РЕЗУЛЬТАТА В ФАЙЛ
    FIND_BY_FIELD, //МНОГОПОТОЧНЫЙ ПОИСК ПО ЗНАЧЕНИЮ ПОЛЯ

    // НЕ ЭКРАНЫ, СКОРЕЕ КАК ИНДЕНТИФИКАТОРЫ ДЛЯ UI
    HOME, // К САМОМУ ПЕРВОМУ ЭКРАНУ
    BACK, // НАЗАД ПО ИСТОРИИ ЭКРАНОВ
    EXIT // ЗАВЕРШИТЬ ПРИЛОЖЕНИЕ
}